app/controllers/myurls_controller.rb

SELECT "myurls".* FROM "myurls"
---
  def thishowedoprivaterkm678rsm
    @myurls = Myurl.all

INSERT INTO "myurls" ("key", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["key", "uyiuydd"], ["url", "http://www.risingplay.com"], ["created_at", "2016-05-10 10:55:20.075974"], ["updated_at", "2016-05-10 10:55:20.075974"]]
SELECT  "myurls".* FROM "myurls" WHERE "myurls"."key" = ? LIMIT 1  [["key", ""]]
UPDATE "myurls" SET "key" = ?, "updated_at" = ? WHERE "myurls"."id" = ?  [["key", "6"], ["updated_at", "2016-05-10 17:40:05.282032"], ["id", 6]]
---
  def create
    @myurl = Myurl.new(myurl_params)

    if @myurl.valid?

      if @myurl.url =~ /\A#{URI::regexp}\z/
        @myurl.key = @myurl.key.gsub(/\s+/, "")

      	if @myurl.key.nil? || @myurl.key == ""
          @myurl.save
          @myurl.key = @myurl.id.to_s(16)
          @myurl.save
          redirect_to(:action => 'new',:createdurl => "http://xyzurl.com/#{@myurl.key}")

        elsif Myurl.find_by_key(@myurl.key).nil?
          @myurl.save

DELETE FROM "myurls" WHERE "myurls"."id" = ?  [["id", 1]]
SELECT  "myurls".* FROM "myurls" WHERE "myurls"."id" = ? LIMIT 1  [["id", 1]]
---
  def delete
    Myurl.find(params[:myurl_id]).destroy

SELECT  "myurls".* FROM "myurls" WHERE "myurls"."key" = ? LIMIT 1  [["key", "style"]]
---
  def redirect
    if Myurl.find_by_key(params[:key]).nil?